app/controllers/home_controller.rb

SELECT "plans".* FROM "plans"
SELECT "userplans".* FROM "userplans"
SELECT "users".* FROM "users"
SELECT "userplans"."user_id" FROM "userplans"
SELECT "userplans"."satisfied" FROM "userplans"
---
  def top
     @userplans = Userplan.all
     @users = User.all
     @plans = Plan.all

    users_tmp = @userplans.pluck(:user_id)
    satisfied = @userplans.pluck(:satisfied).sort.reverse

SELECT "plans".* FROM "plans"
SELECT "userplans".* FROM "userplans"
SELECT "users".* FROM "users"
---
  def data
    @userplans = Userplan.all
    @users = User.all